org/org-docs/tdd-card-display-simple/suit_new.org
# * スーツを数値にする機能のテストと実装

#+BEGIN_SRC sh :exports none 
mkdir -p babel/simple/suit_new/src babel/simple/suit_new/test
rm -f babel/simple/suit_new/src/* babel/simple/suit_new/test/*
cp -Rp babel/simple/setup/Makefile babel/simple/suit_new/Makefile
cp -Rp babel/simple/setup/src/Makefile babel/simple/suit_new/src/Makefile
cp -Rp babel/simple/setup/test/Makefile babel/simple/suit_new/test/Makefile
#+END_SRC

#+RESULTS:

  まず最初は，文字列で表されたスーツを，プログラム内部での数値に変換す
  る機能のテストです。

  あわせてテスト等のビルドのためMakefileを作成していきます。
   
** テスト作成

    テストは，test/test_card.c に作成します。

    機能の名前を card_suit_new_from_string とし,
    card_suit_new_from_string のAPIを決めるため，
    card_suit_new_from_string が満たすテストを書きます:
     
#+BEGIN_SRC c 
// test/test_card.c
  cut_assert(card_suit_new_from_string("SPADE")==SPADE);
#+END_SRC

    cut_assert は引数の値が真ならばテスト成功，偽ならばテスト失敗
    とする cutter の機能です。失敗のときは，情報を提供してくれます。

    card_suit_new_from_stringを関数の形で書けたので，関数の型を決めま
    す。

    戻り値の型は int，与える引数はスーツを示す文字列なので:

#+BEGIN_SRC c
  int card_suit_new_from_string(char *);
#+END_SRC

    そして，cutterが提供する機能を使うためのインタフェースをインクルー
    ドします:

#+BEGIN_SRC c
# include <cutter.h>
#+END_SRC

    テストに使う定数は，列挙型 ([[https://ja.wikipedia.org/wiki/%E5%88%97%E6%8C%99%E5%9E%8B][列挙型 - Wikipedia]]) で書いてみます:

#+name: suit_new_e_suit
#+BEGIN_SRC c

  enum e_Suit {CLUB=1, DIAMOND, HEART, SPADE};

#+END_SRC
    まだ列挙型を使かったことがないかもしれませんが，便利なので憶えましょ
    う。これは，define で定義する次のコードと似ています:
#+BEGIN_SRC c

  # define SPADE 4
  # define HEART 3
  # define DIAMOND 2
  # define CLUB 1

#+END_SRC

    次に，テストに必要なことを記述します:

    - テスト・フレームワークとして cutter を使うので，必要な宣言をインク
      ルードする:

#+BEGIN_SRC c 

// test/test_card.c
# include <cutter.h>

#+END_SRC

    - テストを関数にする。cutterからの要請で，関数名は test_ で始まる
      名前で，型は，void (void) です:

#+BEGIN_SRC c

// test/test_card.c
void
test_card_suit_new_from_string(void)
{
  cut_set_message("文字列からスーツを作成する。");
  cut_assert_true(card_suit_new_from_string("SPADE")==SPADE);
}
#+END_SRC

    これだけです。

    ここまでで，test/test_card.c の中身は:

#+BEGIN_SRC c :tangle babel/simple/suit_new/test/test_card.1.c
// test/test_card.c
# include <cutter.h>

enum e_Suit {CLUB=1, DIAMOND, HEART, SPADE};

enum e_Suit card_suit_new_from_string(char *);

void
test_card_suit_new_from_string(void)
{
  cut_set_message("文字列からスーツを作成する。");
  cut_assert_true(card_suit_new_from_string("SPADE")==SPADE);
}
#+END_SRC

#+BEGIN_SRC sh :exports none :dir babel/simple/suit_new/test
cp test_card.1.c test_card.c
#+END_SRC

#+RESULTS:

** test/Makefileの作成

   test/Makefile は，とりあえず，test_card.c をコンパイルするこ
   とです:

   Makefileに次のように規則を書き加えます:

#+BEGIN_SRC makefile

# test/Makefile
test_card.o: test_card.c
	gcc -c $<

#+END_SRC

    test_card.c がインクルードしている cutter.h がどこにあるのかは，次
    のコマンドを実行するとわかります:

#+BEGIN_SRC sh :results output :exports both
# ~/progs/CardDisplay/simple/
pkg-config cutter --cflags
#+END_SRC

#+RESULTS:
: -I/usr/include/cutter  


    cutter.hをインクルードするためのコンパイラへの指示が出力されていま
    す。

    これをMakefileに記述します:

#+BEGIN_SRC makefile :tangle babel/simple/suit_new/test/Makefile.1
# test/Makefile
.PHONY: clean 
CFLAGS = -fPIC `pkg-config cutter --cflags`

test_card.o: test_card.c
	gcc -c $< $(CFLAGS)

clean:
	rm -f *.o *.so *~ \#* *.gch

#+END_SRC

#+BEGIN_SRC sh :exports none :dir babel/simple/suit_new/test
cp Makefile.1 Makefile
#+END_SRC

#+RESULTS:


** 最初の make

   test/{test_card.c, Makefile}ができたので，make してみましょう:

#+BEGIN_SRC sh :results output :dir babel/simple/suit_new/test :exports both

# ~/progs/card_display/simple/test
make clean
make test_card.o

#+END_SRC

#+RESULTS:
: rm -f *.o *.so *~ \#* *.gch
: gcc -c test_card.c -fPIC -I../src `pkg-config cutter --cflags`

   コンパイルが成功し，test/test_card.o ができていれば，
   test/test_card.o の中身を見てみましょう:

#+BEGIN_SRC sh :results output :dir babel/simple/suit_new/test :exports both
# ~/progs/card_display/simple/test
nm test_card.o

#+END_SRC

#+RESULTS:
#+begin_example
                 U _GLOBAL_OFFSET_TABLE_
0000000000000200 r __PRETTY_FUNCTION__.3239
                 U _setjmp
                 U card_suit_new_from_string
                 U cut_assert_helper
                 U cut_test_context_current_peek
                 U cut_test_context_finish_user_message_jump
                 U cut_test_context_get_have_current_result
                 U cut_test_context_get_jump_buffer
                 U cut_test_context_in_user_message_jump
                 U cut_test_context_long_jump
                 U cut_test_context_pop_backtrace
                 U cut_test_context_process_current_result
                 U cut_test_context_push_backtrace
                 U cut_test_context_set_jump_buffer
                 U cut_test_context_set_user_message
                 U cut_test_context_start_user_message_jump
0000000000000000 T test_card_suit_new_from_string
#+end_example

   card_suit_from_string, cut_assert が未定義で，
   test_card_suit_new_from_string が定義されているのがわかります。

** cutterによるテスト

   cutter でテストしてみましょう:

#+BEGIN_SRC sh :results output :dir babel/simple/suit_new/ :exports both
cutter -v v test
#+END_SRC

#+RESULTS:
: 
: Finished in 0.000062 seconds (total: 0.000000 seconds)
: 
: 0 test(s), 0 assertion(s), 0 failure(s), 0 error(s), 0 pending(s), 0 omission(s), 0 notification(s)
: 0% passed

   test(s)が0と表示されているので， test_card.oはテストとして認識され
   ていないことが分かります。

