org/org-docs/tdd-card-display-simple/suit_new.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>suit_new</title>
<!-- 2015-11-21 土 17:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Masayuki Suzuki" />
</head>
<body>
<div id="content">
<h1 class="title">suit_new</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. テスト作成</a></li>
<li><a href="#sec-2">2. test/Makefileの作成</a></li>
<li><a href="#sec-3">3. 最初の make</a></li>
<li><a href="#sec-4">4. cutterによるテスト</a></li>
<li><a href="#sec-5">5. テストのビルド</a></li>
<li><a href="#sec-6">6. card<sub>suit</sub><sub>new</sub><sub>from</sub><sub>string</sub> の実装</a>
<ul>
<li><a href="#sec-6-1">6.1. src/card.h の作成 <code>card/card.h</code></a></li>
<li><a href="#sec-6-2">6.2. test/test<sub>card</sub>.cの変更</a></li>
<li><a href="#sec-6-3">6.3. test/Makefileの変更</a></li>
<li><a href="#sec-6-4">6.4. src/card.c の作成</a></li>
<li><a href="#sec-6-5">6.5. src/Makefile</a></li>
<li><a href="#sec-6-6">6.6. テスト test/test<sub>card</sub>.so のビルド</a></li>
</ul>
</li>
<li><a href="#sec-7">7. テスト</a></li>
<li><a href="#sec-8">8. テストと再設計</a></li>
</ul>
</div>
</div>
<p>
まず最初は，文字列で表されたスーツを，プログラム内部での数値に変換す
る機能のテストです。
</p>

<p>
あわせてテスト等のビルドのためMakefileを作成していきます。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> テスト作成</h2>
<div class="outline-text-2" id="text-1">
<p>
テストは，test/test<sub>card</sub>.c に作成します。
</p>

<p>
機能の名前を card<sub>suit</sub><sub>new</sub><sub>from</sub><sub>string</sub> とし,
card<sub>suit</sub><sub>new</sub><sub>from</sub><sub>string</sub> のAPIを決めるため，
card<sub>suit</sub><sub>new</sub><sub>from</sub><sub>string</sub> が満たすテストを書きます:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b22222;">// </span><span style="color: #b22222;">test/test_card.c</span>
  cut_assert(card_suit_new_from_string(<span style="color: #8b2252;">"SPADE"</span>)==SPADE);
</pre>
</div>

<p>
cut<sub>assert</sub> は引数の値が真ならばテスト成功，偽ならばテスト失敗
とする cutter の機能です。失敗のときは，情報を提供してくれます。
</p>

<p>
card<sub>suit</sub><sub>new</sub><sub>from</sub><sub>stringを関数の形で書けたので，関数の型を決めま</sub>
す。
</p>

<p>
戻り値の型は int，与える引数はスーツを示す文字列なので:
</p>

<div class="org-src-container">

<pre class="src src-c">  <span style="color: #228b22;">int</span> <span style="color: #0000ff;">card_suit_new_from_string</span>(<span style="color: #228b22;">char</span> *);
</pre>
</div>

<p>
そして，cutterが提供する機能を使うためのインタフェースをインクルー
ドします:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;"># include</span> <span style="color: #8b2252;">&lt;cutter.h&gt;</span>
</pre>
</div>

<p>
テストに使う定数は，列挙型 (<a href="https://ja.wikipedia.org/wiki/%E5%88%97%E6%8C%99%E5%9E%8B">列挙型 - Wikipedia</a>) で書いてみます:
</p>

<div class="org-src-container">

<pre class="src src-c" id="suit_new_e_suit">  <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">e_Suit</span> {<span style="color: #a0522d;">CLUB</span>=1, <span style="color: #a0522d;">DIAMOND</span>, <span style="color: #a0522d;">HEART</span>, <span style="color: #a0522d;">SPADE</span>};
</pre>
</div>
<p>
まだ列挙型を使かったことがないかもしれませんが，便利なので憶えましょ
う。これは，define で定義する次のコードと似ています:
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;">  # define</span> <span style="color: #a0522d;">SPADE</span> 4
<span style="color: #483d8b;">  # define</span> <span style="color: #a0522d;">HEART</span> 3
<span style="color: #483d8b;">  # define</span> <span style="color: #a0522d;">DIAMOND</span> 2
<span style="color: #483d8b;">  # define</span> <span style="color: #a0522d;">CLUB</span> 1
</pre>
</div>

<p>
次に，テストに必要なことを記述します:
</p>

<ul class="org-ul">
<li>テスト・フレームワークとして cutter を使うので，必要な宣言をインク
ルードする:
</li>
</ul>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b22222;">// </span><span style="color: #b22222;">test/test_card.c</span>
<span style="color: #483d8b;"># include</span> <span style="color: #8b2252;">&lt;cutter.h&gt;</span>
</pre>
</div>

<ul class="org-ul">
<li>テストを関数にする。cutterからの要請で，関数名は test_ で始まる
名前で，型は，void (void) です:
</li>
</ul>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b22222;">// </span><span style="color: #b22222;">test/test_card.c</span>
<span style="color: #228b22;">void</span>
<span style="color: #0000ff;">test_card_suit_new_from_string</span>(<span style="color: #228b22;">void</span>)
{
  cut_set_message(<span style="color: #8b2252;">"&#25991;&#23383;&#21015;&#12363;&#12425;&#12473;&#12540;&#12484;&#12434;&#20316;&#25104;&#12377;&#12427;&#12290;"</span>);
  cut_assert_true(card_suit_new_from_string(<span style="color: #8b2252;">"SPADE"</span>)==SPADE);
}
</pre>
</div>

<p>
これだけです。
</p>

<p>
ここまでで，test/test<sub>card</sub>.c の中身は:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b22222;">// </span><span style="color: #b22222;">test/test_card.c</span>
<span style="color: #483d8b;"># include</span> <span style="color: #8b2252;">&lt;cutter.h&gt;</span>

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">e_Suit</span> {<span style="color: #a0522d;">CLUB</span>=1, <span style="color: #a0522d;">DIAMOND</span>, <span style="color: #a0522d;">HEART</span>, <span style="color: #a0522d;">SPADE</span>};

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">e_Suit</span> <span style="color: #0000ff;">card_suit_new_from_string</span>(<span style="color: #228b22;">char</span> *);

<span style="color: #228b22;">void</span>
<span style="color: #0000ff;">test_card_suit_new_from_string</span>(<span style="color: #228b22;">void</span>)
{
  cut_set_message(<span style="color: #8b2252;">"&#25991;&#23383;&#21015;&#12363;&#12425;&#12473;&#12540;&#12484;&#12434;&#20316;&#25104;&#12377;&#12427;&#12290;"</span>);
  cut_assert_true(card_suit_new_from_string(<span style="color: #8b2252;">"SPADE"</span>)==SPADE);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> test/Makefileの作成</h2>
<div class="outline-text-2" id="text-2">
<p>
test/Makefile は，とりあえず，test<sub>card</sub>.c をコンパイルするこ
とです:
</p>

<p>
Makefileに次のように規則を書き加えます:
</p>

<div class="org-src-container">

<pre class="src src-makefile"><span style="color: #b22222;"># </span><span style="color: #b22222;">test/Makefile</span>
<span style="color: #0000ff;">test_card.o</span>: test_card.c
        gcc -c $<span style="color: #008b8b;">&lt;</span>
</pre>
</div>

<p>
test<sub>card</sub>.c がインクルードしている cutter.h がどこにあるのかは，次
のコマンドを実行するとわかります:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">~/progs/CardDisplay/simple/</span>
pkg-config cutter --cflags
</pre>
</div>

<p>
cutter.hをインクルードするためのコンパイラへの指示が出力されていま
す。
</p>

<p>
これをMakefileに記述します:
</p>

<div class="org-src-container">

<pre class="src src-makefile"><span style="color: #b22222;"># </span><span style="color: #b22222;">test/Makefile</span>
<span style="color: #0000ff;">.PHONY</span>: clean 
<span style="color: #a0522d;">CFLAGS</span> = <span style="color: #8b2252;">`pkg-config cutter --cflags`</span>

<span style="color: #0000ff;">test_card.o</span>: test_card.c
        gcc -c $<span style="color: #008b8b;">&lt;</span> $(<span style="color: #a0522d;">CFLAGS</span>)

<span style="color: #0000ff;">clean</span>:
        rm -f *.o *.so *~ \#* *.gch
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 最初の make</h2>
<div class="outline-text-2" id="text-3">
<p>
test/{test<sub>card</sub>.c, Makefile}ができたので，make してみましょう:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">~/progs/card_display/simple/test</span>
make
</pre>
</div>

<p>
コンパイルが成功し，test/test<sub>card</sub>.o ができていれば，
test/test<sub>card</sub>.o の中身を見てみましょう:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">~/progs/card_display/simple/test</span>
nm test_card.o
</pre>
</div>

<p>
card<sub>suit</sub><sub>from</sub><sub>string</sub>, cut<sub>assert</sub> が未定義で，
test<sub>card</sub><sub>suit</sub><sub>new</sub><sub>from</sub><sub>string</sub> が定義されているのがわかります。
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> cutterによるテスト</h2>
<div class="outline-text-2" id="text-4">
<p>
cutter でテストしてみましょう:
</p>

<div class="org-src-container">

<pre class="src src-sh">cutter -v v test
</pre>
</div>

<p>
test(s)が0と表示されているので， test<sub>card</sub>.oはテストとして認識され
ていないことが分かります。
</p>
</div>
</div>
