org/org-docs/tdd-card-display-simple/suit_new.org
** テストのビルド

   cutter は，test_ で始まる動的ライブラリをテストと認めます。なので動的ライ
   ブラリを作ります。そのために test/Makefileに規則を追加します:

#+BEGIN_SRC Makefile

# test/Makefile

CFLAGS = -fPIC `pkg-config cutter --cflags` 
LDFLAGS = `pkg-config --libs cutter`

test_card.so: test_card.o
	gcc -o $@ --shared $^ $(LDFLAGS)

#+END_SRC

    gcc に対するオプション -fPIC とか --shared は動的ライブラリを作る
    ためのものです。
    
    ここまでで test/Makefile 全体は下記のようになります:
    
#+BEGIN_SRC makefile :tangle babel/simple/suit_new/test/Makefile.2
# test/Makefile (2)
.PHONY: clean
CFLAGS = -fPIC `pkg-config cutter --cflags` 
LDFLAGS = `pkg-config --libs cutter`

test_card.so: test_card.o	
	gcc -o $@ --shared $^ $(LDFLAGS)

test_card.o: test_card.c
	gcc -c $< $(CFLAGS)

clean:
	rm -f *.o *.so *~ \#* *.gch
#+END_SRC

#+BEGIN_SRC sh :dir babel/simple/suit_new/test :exports none
cp Makefile.2 Makefile

#+END_SRC

#+RESULTS:

    .soは動的ライブラリを示す拡張子で，gccへのオプション --shared が動
    的ライブラリの作成を意味しています。

    変数LDFLAGSに，ローダへの指示を格納します。pkg-configは，システム
    に組み込まれたパッケージの設定を見るためのコマンドで，--libs は，
    ライブラリとして使う場合のローダへの指示を出力してくれます:

#+BEGIN_SRC sh :results output
pkg-config --libs cutter
#+END_SRC

#+RESULTS:
: -lcutter  

    シェルコマンド中では，コマンドを``で括ることで，そのコマンドの実行
    結果をその場所に埋め込むことを意味します。

    変数LDFLAGS中の `pkg-config --libs cutter`は，gcc コマンド 
    中で参照されることで，cutterライブラリをリンクするため指示を埋め込
    むことができます。

    では，makeしてテストをビルドしてみましょう:

#+BEGIN_SRC sh :results output :dir babel/simple/suit_new/test :exports none

# ~/progs/card_display/simple/test
make test_card.so

#+END_SRC

#+RESULTS:
: Undefined symbols card_suit_new_from_string, referenced from:
:      _test_card_suit_new_from_string in test_card.o
:      (maybe you meant: _test_card_suit_new_from_string)


    card_suit_new_from_string関数がまだ実装されていないため，みつから
    ない旨のエラーが出て，test_card.so を作るための make は失敗します。
    が，前進しています。cutterが提供する関数への参照は全て解決され，ま
    だ未実装の card_suit_new_from_string のみ未解決となっていることを
    理解してください。

** card_suit_new_from_string の実装

   さて次は，機能 card_suit_new_from_string の実装です。
   以下のように実装しましょう:
   - test/test_card.c を作成するときに決めたインタフェースをとりだし，
     src/card.hを作成する。
   - test/test_card.c の対応部分は # include <card.h> とする。
     - test/Makefile も変更する
   - src/card.hを遵守し，src/card.c を作成する。
   - 提供する機能を入れた src/libcard.a を作成する，Makefileを作成す
     る

   *src/{card.h，libcard.a} で機能を提供します*

*** src/card.h の作成 =card/card.h=

    test/test_card.c から card_suit_new_from_string に関する宣言を取り出し， 
    src/card.h にします。

#+BEGIN_SRC c :tangle babel/simple/suit_new/src/card.h
// src/card.h
enum e_Suit {CLUB=1,DIAMOND,HEART,SPADE};

enum e_Suit card_suit_new_from_string(char *);
#+END_SRC

*** test/test_card.cの変更

    インタフェースの定義を，src/card.h に移し，定義の責任を src/ に移
    します。test/ は，責任者の定義に従うという意味で，ヘッダファイル
    をインクルードします:

#+BEGIN_SRC c
// test/test_card.c
# include <card.h>

#+END_SRC    

    <card.h> は， コンパイラのインクルード・パス上の card.h という名前
    のファイルを意味します。今 test/test_card.c にとって，<card.h> は
    ../src/card.h を意味します。ですが，次のように書いてはいけません:

#+BEGIN_SRC c
# include "../src/card.h"

#+END_SRC    

    test/test_card.c は，下記のようになります:

#+BEGIN_SRC c :tangle babel/simple/suit_new/test/test_card.2.c
// test/test_card.c
# include <cutter.h>
# include <card.h>

void
test_card_suit_new_from_string(void)
{
  cut_set_message("文字列からスーツを作成する。");
  cut_assert(card_suit_new_from_string("SPADE")==SPADE);
  cut_assert(card_suit_new_from_string("HEART")==HEART);
  cut_assert(card_suit_new_from_string("DIAMOND")==DIAMOND);
  cut_assert(card_suit_new_from_string("CLUB")==CLUB);
}
#+END_SRC

    ここで，説明を簡略化するため，HEART, DIAMOND, CLUB のテストも追加してしま
    いましたが，本来はひとつテストが通ってから，増やしていくべきです。

#+BEGIN_SRC sh :exports none :dir babel/simple/suit_new/test
cp test_card.2.c test_card.c
#+END_SRC

#+RESULTS:

*** test/Makefileの変更

    src/card.hがインクルードできるようにインクルードパスをコンパイラに
    指示します。具体的には，CFLAGSを以下のように書き換えます:

#+BEGIN_SRC make
CFLAGS = -fPIC -I../src `pkg-config cutter --cflags`
#+END_SRC    

    変更後，makeして，以前と同じ状態であることを確かめておきましょう。

*** src/card.c の作成

    src/card.h に書かれている API を守って，card_suit_new_from_string
    関数を実装します。

    取り敢えず，与えられた文字列 suit_str と，スーツ文字列を比較して判
    定することにします。

#+BEGIN_SRC c :tangle babel/simple/suit_new/src/card.1.c
// src/card.c
# include <string.h>
# include <card.h>

enum e_Suit
card_suit_new_from_string(char *suit_str)
{
  if (strcmp("CLUB", suit_str)==0)
    return CLUB;
  if (strcmp("DIAMOND", suit_str)==0)
    return DIAMOND;
  if (strcmp("HEART", suit_str)==0)
    return HEART;
  if (strcmp("SPADE", suit_str)==0)
    return SPADE;
  return 0;
}
#+END_SRC

#+BEGIN_SRC sh :exports none :dir babel/simple/suit_new/src
cp card.1.c card.c
#+END_SRC

#+RESULTS:

