org/org-docs/tdd-card-display-simple/suit_new.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> テストのビルド</h2>
<div class="outline-text-2" id="text-5">
<p>
cutter は，test_ で始まる動的ライブラリをテストと認めます。なので動的ライ
ブラリを作ります。そのために test/Makefileに規則を追加します:
</p>

<div class="org-src-container">

<pre class="src src-makefile"><span style="color: #b22222;"># </span><span style="color: #b22222;">test/Makefile</span>

<span style="color: #a0522d;">CFLAGS</span> = -fPIC <span style="color: #8b2252;">`pkg-config cutter --cflags`</span> 
<span style="color: #a0522d;">LDFLAGS</span> = <span style="color: #8b2252;">`pkg-config --libs cutter`</span>

<span style="color: #0000ff;">test_card.so</span>: test_card.o
        gcc -o <span style="color: #0000ff;">$</span><span style="color: #008b8b;">@</span> --shared $<span style="color: #008b8b;">^</span> $(<span style="color: #a0522d;">LDFLAGS</span>)
</pre>
</div>

<p>
gcc に対するオプション -fPIC とか &#x2013;shared は動的ライブラリを作る
ためのものです。
</p>

<p>
ここまでで test/Makefile 全体は下記のようになります:
</p>

<div class="org-src-container">

<pre class="src src-makefile"><span style="color: #b22222;"># </span><span style="color: #b22222;">test/Makefile</span>
<span style="color: #0000ff;">.PHONY</span>: clean
<span style="color: #a0522d;">CFLAGS</span> = -fPIC <span style="color: #8b2252;">`pkg-config cutter --cflags`</span> 
<span style="color: #a0522d;">LDFLAGS</span> = <span style="color: #8b2252;">`pkg-config --libs cutter`</span>

<span style="color: #0000ff;">test_card.so</span>: test_card.o       
        gcc -o <span style="color: #0000ff;">$</span><span style="color: #008b8b;">@</span> --shared $<span style="color: #008b8b;">^</span> $(<span style="color: #a0522d;">LDFLAGS</span>)

<span style="color: #0000ff;">test_card.o</span>: test_card.c
        gcc -c $<span style="color: #008b8b;">&lt;</span> $(<span style="color: #a0522d;">CFLAGS</span>)

<span style="color: #0000ff;">clean</span>:
        rm -f *.o *.so *~ \#* *.gch
</pre>
</div>

<p>
.soは動的ライブラリを示す拡張子で，gccへのオプション &#x2013;shared が動
的ライブラリの作成を意味しています。
</p>

<p>
変数LDFLAGSに，ローダへの指示を格納します。pkg-configは，システム
に組み込まれたパッケージの設定を見るためのコマンドで，&#x2013;libs は，
ライブラリとして使う場合のローダへの指示を出力してくれます:
</p>

<div class="org-src-container">

<pre class="src src-sh">pkg-config --libs cutter
</pre>
</div>

<p>
シェルコマンド中では，コマンドを``で括ることで，そのコマンドの実行
結果をその場所に埋め込むことを意味します。
</p>

<p>
変数LDFLAGS中の `pkg-config &#x2013;libs cutter`は，gcc コマンド 
中で参照されることで，cutterライブラリをリンクするため指示を埋め込
むことができます。
</p>

<p>
では，makeしてテストをビルドしてみましょう:
</p>

<p>
Undefined symbols card<sub>suit</sub><sub>new</sub><sub>from</sub><sub>string</sub>, referenced from:
      _test<sub>card</sub><sub>suit</sub><sub>new</sub><sub>from</sub><sub>string</sub> in test<sub>card</sub>.o
     (maybe you meant: _test<sub>card</sub><sub>suit</sub><sub>new</sub><sub>from</sub><sub>string</sub>)
</p>


<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">~/progs/card_display/simple/test</span>
make test_card.so
</pre>
</div>

<p>
card<sub>suit</sub><sub>new</sub><sub>from</sub><sub>string関数がまだ実装されていないため，みつから</sub>
ない旨のエラーが出て，test<sub>card</sub>.so を作るための make は失敗します。
が，前進しています。cutterが提供する関数への参照は全て解決され，ま
だ未実装の card<sub>suit</sub><sub>new</sub><sub>from</sub><sub>string</sub> のみ未解決となっていることを
理解してください。
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> card<sub>suit</sub><sub>new</sub><sub>from</sub><sub>string</sub> の実装</h2>
<div class="outline-text-2" id="text-6">
<p>
さて次は，機能 card<sub>suit</sub><sub>new</sub><sub>from</sub><sub>string</sub> の実装です。
以下のように実装しましょう:
</p>
<ul class="org-ul">
<li>test/test<sub>card</sub>.c を作成するときに決めたインタフェースをとりだし，
src/card.hを作成する。
</li>
<li>test/test<sub>card</sub>.c の対応部分は # include &lt;card.h&gt; とする。
<ul class="org-ul">
<li>test/Makefile も変更する
</li>
</ul>
</li>
<li>src/card.hを遵守し，src/card.c を作成する。
</li>
<li>提供する機能を入れた src/libcard.a を作成する，Makefileを作成す
る
</li>
</ul>

<p>
<b>src/{card.h，libcard.a} で機能を提供します</b>
</p>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> src/card.h の作成 <code>card/card.h</code></h3>
<div class="outline-text-3" id="text-6-1">
<p>
test/test<sub>card</sub>.c から card<sub>suit</sub><sub>new</sub><sub>from</sub><sub>string</sub> に関する宣言を取り出し， 
src/card.h にします。
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b22222;">// </span><span style="color: #b22222;">src/card.h</span>
<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">e_Suit</span> {<span style="color: #a0522d;">CLUB</span>=1,<span style="color: #a0522d;">DIAMOND</span>,<span style="color: #a0522d;">HEART</span>,<span style="color: #a0522d;">SPADE</span>};

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">e_Suit</span> <span style="color: #0000ff;">card_suit_new_from_string</span>(<span style="color: #228b22;">char</span> *);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> test/test<sub>card</sub>.cの変更</h3>
<div class="outline-text-3" id="text-6-2">
<p>
インタフェースの定義を，src/card.h に移し，定義の責任を src/ に移
します。test/ は，責任者の定義に従うという意味で，ヘッダファイル
をインクルードします:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b22222;">// </span><span style="color: #b22222;">test/test_card.c</span>
<span style="color: #483d8b;"># include</span> <span style="color: #8b2252;">&lt;card.h&gt;</span>
</pre>
</div>

<p>
&lt;card.h&gt; は， コンパイラのインクルード・パス上の card.h という名前
のファイルを意味します。今 test/test<sub>card</sub>.c にとって，&lt;card.h&gt; は
../src/card.h を意味します。ですが，次のように書いてはいけません:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;"># include</span> <span style="color: #8b2252;">"../src/card.h"</span>
</pre>
</div>

<p>
test/test<sub>card</sub>.c は，下記のようになります:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b22222;">// </span><span style="color: #b22222;">test/test_card.c</span>
<span style="color: #483d8b;"># include</span> <span style="color: #8b2252;">&lt;cutter.h&gt;</span>
<span style="color: #483d8b;"># include</span> <span style="color: #8b2252;">&lt;card.h&gt;</span>

<span style="color: #228b22;">void</span>
<span style="color: #0000ff;">test_card_suit_new_from_string</span>(<span style="color: #228b22;">void</span>)
{
  cut_set_message(<span style="color: #8b2252;">"&#25991;&#23383;&#21015;&#12363;&#12425;&#12473;&#12540;&#12484;&#12434;&#20316;&#25104;&#12377;&#12427;&#12290;"</span>);
  cut_assert(card_suit_new_from_string(<span style="color: #8b2252;">"SPADE"</span>)==SPADE);
  cut_assert(card_suit_new_from_string(<span style="color: #8b2252;">"HEART"</span>)==HEART);
  cut_assert(card_suit_new_from_string(<span style="color: #8b2252;">"DIAMOND"</span>)==DIAMOND);
  cut_assert(card_suit_new_from_string(<span style="color: #8b2252;">"CLUB"</span>)==CLUB);
}
</pre>
</div>

<p>
ここで，説明を簡略化するため，HEART, DIAMOND, CLUB のテストも追加してしま
いましたが，本来はひとつテストが通ってから，増やしていくべきです。
</p>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> test/Makefileの変更</h3>
<div class="outline-text-3" id="text-6-3">
<p>
src/card.hがインクルードできるようにインクルードパスをコンパイラに
指示します。具体的には，CFLAGSを以下のように書き換えます:
</p>

<div class="org-src-container">

<pre class="src src-make">CFLAGS = -I../src `pkg-config cutter --cflags`
</pre>
</div>

<p>
変更後，makeして，以前と同じ状態であることを確かめておきましょう。
</p>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> src/card.c の作成</h3>
<div class="outline-text-3" id="text-6-4">
<p>
src/card.h に書かれている API を守って，card<sub>suit</sub><sub>new</sub><sub>from</sub><sub>string</sub>
関数を実装します。
</p>

<p>
取り敢えず，与えられた文字列 suit<sub>str</sub> と，スーツ文字列を比較して判
定することにします。
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b22222;">// </span><span style="color: #b22222;">src/card.c</span>
<span style="color: #483d8b;"># include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>
<span style="color: #483d8b;"># include</span> <span style="color: #8b2252;">&lt;card.h&gt;</span>

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">e_Suit</span>
<span style="color: #0000ff;">card_suit_new_from_string</span>(<span style="color: #228b22;">char</span> *<span style="color: #a0522d;">suit_str</span>)
{
  <span style="color: #a020f0;">if</span> (strcmp(<span style="color: #8b2252;">"CLUB"</span>, suit_str)==0)
    <span style="color: #a020f0;">return</span> CLUB;
  <span style="color: #a020f0;">if</span> (strcmp(<span style="color: #8b2252;">"DIAMOND"</span>, suit_str)==0)
    <span style="color: #a020f0;">return</span> DIAMOND;
  <span style="color: #a020f0;">if</span> (strcmp(<span style="color: #8b2252;">"HEART"</span>, suit_str)==0)
    <span style="color: #a020f0;">return</span> HEART;
  <span style="color: #a020f0;">if</span> (strcmp(<span style="color: #8b2252;">"SPADE"</span>, suit_str)==0)
    <span style="color: #a020f0;">return</span> SPADE;
  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>
</div>
</div>
