org/org-docs/tdd-card-display-simple/suit_new.org
*** src/Makefile

    src/card.c をコンパイルし，src/libcard.a を作成する規則を追加しま
    しょう:

#+BEGIN_SRC makefile :tangle babel/simple/suit_new/src/Makefile.2
# src/Makefile 
.PHONY: clean
CFLAGS = -g -c -fPIC -I. 
LDFLAGS = -lc

libcard.a: card.o
	rm -f $@
	ar r $@ $^

card.o: card.c card.h
	gcc $< $(CFLAGS)

clean: 
	rm -f *.o *.so *~ \#* *.gch
#+END_SRC

#+BEGIN_SRC sh :dir babel/simple/suit_new/src :exports none
cp Makefile.2 Makefile

#+END_SRC

#+RESULTS:

  ビルドしてみましょう:

#+BEGIN_SRC sh :results output :dir babel/simple/suit_new/src :exports both
# ~/progs/card_display/simple/src
make clean
make libcard.a

#+END_SRC

#+RESULTS:
: rm -f *.o *.so *~ \#* *.gch
: gcc card.c -g -c -fPIC -I. 
: rm -f libcard.a
: ar r libcard.a card.o

  src/card.h と src/card.c に文法上のエラーや宣言上の食い違いがなけれ
  あば，card.o ができているはずです。

  card.o ができて，Makefile に間違いがなければ libcard.a もできている
  はずです。

  libcard.a の中身を確かめて，card_suit_new_from_string 関数が入ってい
  るか，確かめてみましょう:

#+BEGIN_SRC sh :results output :dir babel/simple/suit_new/src :exports both
# ~/progs/card_display/simple/src
nm libcard.a

#+END_SRC

#+RESULTS:
: 
: card.o:
:                  U _GLOBAL_OFFSET_TABLE_
: 0000000000000000 T card_suit_new_from_string
:                  U strcmp

*** テスト test/test_card.so のビルド

    src/libcard.a ができたので，次は test/test_card.so に libcard.a を取り
    込むようにmakeの規則を書き換えます:

#+BEGIN_SRC makefile
LDFLAGS = -L../src/ -lcard `pkg-config cutter --libs`
#+END_SRC

    test/Makefileは下記のようになります:

#+BEGIN_SRC makefile :tangle babel/simple/suit_new/test/Makefile.3
# test/Makefile (3) 
.PHONY: clean
CFLAGS = -fPIC -I../src `pkg-config cutter --cflags`
LDFLAGS = -L../src/ -lcard `pkg-config cutter --libs`

test_card.so: test_card.o
	gcc -o $@ --shared $^ $(LDFLAGS)

test_card.o: test_card.c
	gcc -c $< $(CFLAGS)

clean:
	rm -f *.o *.so *~ \#* *.gch

#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :exports none :dir babel/simple/suit_new/test
cp Makefile.3 Makefile
#+END_SRC

#+RESULTS:

    make し，src/libcard.a を取り込んだ test/test_card.so を作成します:

#+BEGIN_SRC sh :results output :dir babel/simple/suit_new/test
# ~/progs/card_display/simple/test/
make clean
make test_card.so
#+END_SRC

#+RESULTS:
: rm -f *.o *.so *~ \#* *.gch
: gcc -c test_card.c -fPIC -I../src `pkg-config cutter --cflags`
: gcc -o test_card.so --shared test_card.o -L../src/ -lcard `pkg-config cutter --libs`

    make の結果中の下記ライン出力中に，
: gcc -o test_card.so --shared test_card.o -L../src/ -lcard `pkg-config cutter --libs`
    
    -L../src/ -lcard `pkg-config cutter --libs`　が含まれていれば，
    test/test_card.so はできあがるはずです。

** テスト
   テストと実装が終わり，テストをビルドするためのMakefileは完成してい
   ます。テストするために simple/ で make してみましょう:

#+BEGIN_SRC sh :results output :dir babel/simple/suit_new/ :exports both
# ~/progs/card_display/simple
make
#+END_SRC

#+RESULTS:
#+begin_example
(cd src; make)
make[1]: ディレクトリ `/home/staff/suzuki/COMM/Lects/prog/site/org-docs/tdd-card-display-simple/babel/simple/suit_new/src' に入ります
make[1]: `libcard.a' は更新済みです
make[1]: ディレクトリ `/home/staff/suzuki/COMM/Lects/prog/site/org-docs/tdd-card-display-simple/babel/simple/suit_new/src' から出ます
(cd test; make)	
make[1]: ディレクトリ `/home/staff/suzuki/COMM/Lects/prog/site/org-docs/tdd-card-display-simple/babel/simple/suit_new/test' に入ります
make[1]: `test_card.so' は更新済みです
make[1]: ディレクトリ `/home/staff/suzuki/COMM/Lects/prog/site/org-docs/tdd-card-display-simple/babel/simple/suit_new/test' から出ます
cutter -v v test/
test_card:
  test_card_suit_new_from_string:			.: (0.000066)

Finished in 0.000464 seconds (total: 0.000066 seconds)

1 test(s), 4 assertion(s), 0 failure(s), 0 error(s), 0 pending(s), 0 omission(s), 0 notification(s)
100% passed
#+end_example

   これからは，機能が要求を満たすことを確かめるためにテストし，テスト
   が失敗した場合は，test/test_card.c, src/{card.h, card.c} を修正
   していくことになります。

** テストと再設計

   テストが通らなかった時，下記の場合が考えられます：
   - 要求自体が間違っていた
   - 要求に対する設計が間違っていた
   - 要求・設計に対する実装が間違っていた

   それぞれどの箇所を見直すか考えてみましょう:

   - 要求が間違っている場合 (テストの作り直し)
     - test/test_card.c の変更
     - src/card.h の変更，それに伴ない
       - test/test_card.c, src/card.c の変更
     
   - 設計が間違っている場合 (インタフェースの見直し)
     - src/card.h の変更，それに伴ない
       - test/test_card.c, src/card.c の変更

   - 実装が間違っている場合 (実装のみの見直し)
     - src/card.c のみの変更

   適切に対処しましょう。



