org/org-docs/tdd-card-display-simple/suit_new.html

<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> src/Makefile</h3>
<div class="outline-text-3" id="text-6-5">
<p>
src/card.c をコンパイルし，src/libcard.a を作成する規則を追加しま
しょう:
</p>

<div class="org-src-container">

<pre class="src src-makefile"><span style="color: #b22222;"># </span><span style="color: #b22222;">src/Makefile </span>
<span style="color: #0000ff;">.PHONY</span>: clean
<span style="color: #a0522d;">CFLAGS</span> = -g -c -fPIC -I. 
<span style="color: #a0522d;">LDFLAGS</span> = -lc

<span style="color: #0000ff;">libcard.a</span>: card.o
        rm -f <span style="color: #0000ff;">$</span><span style="color: #008b8b;">@</span>
        ar r <span style="color: #0000ff;">$</span><span style="color: #008b8b;">@</span> $<span style="color: #008b8b;">^</span>

<span style="color: #0000ff;">card.o</span>: card.c card.h
        gcc $<span style="color: #008b8b;">&lt;</span> $(<span style="color: #a0522d;">CFLAGS</span>)

<span style="color: #0000ff;">clean</span>: 
        rm -f *.o *.so *~ \#* *.gch
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">cp Makefile.2 Makefile
</pre>
</div>

<p>
ビルドしてみましょう:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">~/progs/card_display/simple/src</span>
make clean
make libcard.a
</pre>
</div>

<p>
src/card.h と src/card.c に文法上のエラーや宣言上の食い違いがなけれ
あば，card.o ができているはずです。
</p>

<p>
card.o ができて，Makefile に間違いがなければ libcard.a もできている
はずです。
</p>

<p>
libcard.a の中身を確かめて，card<sub>suit</sub><sub>new</sub><sub>from</sub><sub>string</sub> 関数が入ってい
るか，確かめてみましょう:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">~/progs/card_display/simple/src</span>
nm libcard.a
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> テスト test/test<sub>card</sub>.so のビルド</h3>
<div class="outline-text-3" id="text-6-6">
<p>
src/libcard.a ができたので，次は test/test<sub>card</sub>.so に libcard.a を取り
込むようにmakeの規則を書き換えます:
</p>

<div class="org-src-container">

<pre class="src src-makefile"><span style="color: #a0522d;">LDFLAGS</span> = -L../src/ -lcard <span style="color: #8b2252;">`pkg-config cutter --libs`</span>
</pre>
</div>

<p>
test/Makefileは下記のようになります:
</p>

<div class="org-src-container">

<pre class="src src-makefile"><span style="color: #b22222;"># </span><span style="color: #b22222;">test/Makefile (3) </span>
<span style="color: #0000ff;">.PHONY</span>: clean
<span style="color: #a0522d;">CFLAGS</span> = -fPIC -I../src <span style="color: #8b2252;">`pkg-config cutter --cflags`</span>
<span style="color: #a0522d;">LDFLAGS</span> = -L../src/ -lcard <span style="color: #8b2252;">`pkg-config cutter --libs`</span>

<span style="color: #0000ff;">test_card.so</span>: test_card.o
        gcc -o <span style="color: #0000ff;">$</span><span style="color: #008b8b;">@</span> --shared $<span style="color: #008b8b;">^</span> $(<span style="color: #a0522d;">LDFLAGS</span>)

<span style="color: #0000ff;">test_card.o</span>: test_card.c
        gcc -c $<span style="color: #008b8b;">&lt;</span> $(<span style="color: #a0522d;">CFLAGS</span>)

<span style="color: #0000ff;">clean</span>:
        rm -f *.o *.so *~ \#* *.gch
</pre>
</div>

<p>
make し，src/libcard.a を取り込んだ test/test<sub>card</sub>.so を作成します:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">~/progs/card_display/simple/test/</span>
make clean
make test_card.so
</pre>
</div>

<p>
make の結果中の下記ライン出力中に，
</p>
<pre class="example">
gcc -o test_card.so --shared test_card.o -L../src/ -lcard `pkg-config cutter --libs`
</pre>

<p>
-L../src/ -lcard `pkg-config cutter &#x2013;libs`　が含まれていれば，
test/test<sub>card</sub>.so はできあがるはずです。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> テスト</h2>
<div class="outline-text-2" id="text-7">
<p>
テストと実装が終わり，テストをビルドするためのMakefileは完成してい
ます。テストするために simple/ で make してみましょう:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">~/progs/card_display/simple</span>
make
</pre>
</div>

<p>
これからは，機能が要求を満たすことを確かめるためにテストし，テスト
が失敗した場合は，test/test<sub>card</sub>.c, src/{card.h, card.c} を修正
していくことになります。
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> テストと再設計</h2>
<div class="outline-text-2" id="text-8">
<p>
テストが通らなかった時，下記の場合が考えられます：
</p>
<ul class="org-ul">
<li>要求自体が間違っていた
</li>
<li>要求に対する設計が間違っていた
</li>
<li>要求・設計に対する実装が間違っていた
</li>
</ul>


<p>
それぞれどの箇所を見直すか考えてみましょう:
</p>

<ul class="org-ul">
<li>要求が間違っている場合 (テストの作り直し)
<ul class="org-ul">
<li>test/test<sub>card</sub>.c の変更
</li>
<li>src/card.h の変更，それに伴ない
<ul class="org-ul">
<li>test/test<sub>card</sub>.c, src/card.c の変更
</li>
</ul>
</li>
</ul>
</li>

<li>設計が間違っている場合 (インタフェースの見直し)
<ul class="org-ul">
<li>src/card.h の変更，それに伴ない
<ul class="org-ul">
<li>test/test<sub>card</sub>.c, src/card.c の変更
</li>
</ul>
</li>
</ul>
</li>

<li>実装が間違っている場合 (実装のみの見直し)
<ul class="org-ul">
<li>src/card.c のみの変更
</li>
</ul>
</li>
</ul>

<p>
適切に対処しましょう。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Masayuki Suzuki</p>
<p class="date">Created: 2015-11-21 土 17:07</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
